<template>
  <div class="terms">
    <div class="container">

       <a-collapse
          v-model="index"
          :bordered="false"
          style="background: #F7F7F7;"
        >
          <a-collapse-panel key="1" header="1. Ерөнхий" style="background: #FFFFFF; border-radius: 4px;margin-bottom: 24px;border: 0;overflow: hidden;">
            <p>1. <b>"typing.mn"</b> нь арван хуруугаар бичих дадлыг зөв, хүртээмжтэй байдлаар боловсруулсан сургалтын цогц систем юм.</p>
            <p>2. Үйлчилгээний нөхцөлд дурдагдсан нэр томьёог дараах утгаар ойлгоно. Үүнд: </p>
            <ul>
              <li>"Сургалтын систем" гэж арван хуруугаар бичих дасгал хичээлийг боловсруулан, тухайн үйлчилгээг хэрэглэгчдэд санал болгох үйлчилгээг бүрдүүлсэн цахим вэб хуудас (цаашид <b>Typing</b> гэх)</li>
              <li>"Хэрэглэгч" гэж үйлчилгээний нөхцөлийг хүлээн зөвшөөрч, "Typing"-г хэрэглэж буй иргэний эрх зүйн чадамжтай иргэн, хуулийн этгээдийг тус тус ойлгоно.</li>
            </ul>
            <p>3. Хэрэглэгч нь "Typing"-д нэвтэрч, бүртгүүлэхээс өмнө үйлчилгээний нөхцөлтэй бүрэн танилцах үүрэгтэй. Үйлчилгээний нөхцөлтэй бүрэн танилцаж, эдгээр нөхцлүүдийг хүлээн зөвшөөрсөн тохиолдолд “Би хүлээн зөвшөөрч байна.” гэсэн товчийг идэвхжүүлснээр Хэрэглэгчийг зөвшөөрсөнд тооцно. </p>
            <p>4. Үйлчилгээний нөхцөлийг хэрэгжилтэд "Typing" болон Хэрэглэгч нар нь хамтран хяналт тавина.</p>
          </a-collapse-panel>
          <a-collapse-panel key="2" header="2. Хэрэглэгч болон бүртгүүлэх" style="background: #FFFFFF; border-radius: 4px;margin-bottom: 24px;border: 0;overflow: hidden">
            <p>1. Хэрэглэгч бүртгүүлэх болон нэвтрэхдээ "Нэвтрэх" хэсгийн "Facebook-ээр нэвтрэх" гэсэн товчийг дарж нэвтрэх эсвэл бүртгүүлнэ. </p>
            <p>2. Хэрэглэгчийн фэйсбүүкийн нууц үг болон нэвтрэх нэр зэрэг мэдээлэлд "Typing" нь хандах боломжгүй.</p>
            <p>3. Хэрэглэгч нь өөрийн мэдээллийн үнэн зөв, бодит байдалд бүрэн хариуцлага хүлээнэ.</p>
            <p>3. Хэрэглэгч нь өөрийн бүртгэлээ бусдад хуваалцахгүй байх үүрэг хүлээнэ.</p>
          </a-collapse-panel>
          <a-collapse-panel key="3" header="3. Төлбөр тооцоо" style="background: #FFFFFF; border-radius: 4px;margin-bottom: 24px;border: 0;overflow: hidden">
            <p>1. "Typing.mn" нь 1 сар 5900₮, 3 сар нь 12,900₮ гэсэн төлбөртэй байна.</p>
            <p>2. Үйлчилгээний хугацаа дууссан бол сайт ашиглахад зарим хязгаарлалт хийгдэнэ. Үйлчилгээний төлбөр төлөгдөхөд үйлчилгээний хугацаа сунгагдаж, хязгаарлалт цуцлагдана. </p>
            <p>3. Хэрэглэгчийн зүгээс сэтгэл ханамжгүй байгаа нь төлбөр буцаах үндэслэл болохгүй</p>
          </a-collapse-panel>
          <a-collapse-panel key="4" header="4. Хэрэглэгчийн гомдол, маргаан шийдвэрлэх" style="background: #FFFFFF; border-radius: 4px;margin-bottom: 24px;border: 0;overflow: hidden">
            <p>1. Хэрэглэгч "Typing"-н үйл ажиллагаанд холбогдуулж санал хүсэлт, гомдол гаргах эрхтэй бөгөөд санал хүсэлт, гомдлыг цахим хэлбэрээр (https://www.instagram.com/typing.mn) болон фэйсбүүкээр авна. </p>
            <p>2. Хэрэглэгч нь Үйлчилгээний нөхцлөөр хүлээсэн үүргээ зөрчсөн, Үйлчилгээг хууль бусаар ашигласан, Үйлчилгээ үзүүлэгчийн үйл ажиллагаанд болон бусад Хэрэглэгчдэд хохирол учруулсан нь батлагдвал Хэрэглэгчийн нэвтрэх эрхийг цуцлана.</p>
            <p>3. Үйлчилгээтэй холбоотой санал, гомдол, асуудал, маргааныг Талууд эв, зүйгээр харилцан зөвшилцөх замаар шийдвэрлэнэ. "Typing"-н өгсөн хариу болон авсан арга хэмжээнд сэтгэл хангалуун бус байгаа бол Монгол Улсын хууль, тогтоомжид заасны дагуу шийдвэрлүүлнэ.</p>
            <p>4. Үйлчилгээний тасалдал нь байгалийн давагдашгүй хүчин зүйл (гал, үер, газар хөдлөлт, аянга болон тэсрэлт) эсвэл төрийн эрх бүхий байгууллагаас гаргасан хуулийн зохицуулалт, журам, хэрэгжүүлсэн үйл ажиллагаа, ажил хаялт, дайн, террорист халдлага, гоц халдварт өвчин зэрэгтэй холбоотой бол Үйлчилгээг тасалдсанд тооцохгүй бөгөөд Үйлчилгээ үзүүлэгч хариуцлага хүлээх үндэслэл болохгүй.</p>
          </a-collapse-panel>
        </a-collapse>
    </div>


    <div style="width: 100%; position: fixed; bottom: 0;">
			<a-layout-footer>
				<a-row type="flex">
					<a-col :span="24" :md="12">

						<!-- Footer Copyright Notice -->
						<p class="copyright">
							© {{year}},
							<svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path fill-rule="evenodd" clip-rule="evenodd" d="M3.17157 5.17157C4.73367 3.60948 7.26633 3.60948 8.82843 5.17157L10 6.34315L11.1716 5.17157C12.7337 3.60948 15.2663 3.60948 16.8284 5.17157C18.3905 6.73367 18.3905 9.26633 16.8284 10.8284L10 17.6569L3.17157 10.8284C1.60948 9.26633 1.60948 6.73367 3.17157 5.17157Z" fill="#111827"/>
							</svg> -аар бүтээв.
						</p>
						<!-- / Footer Copyright Notice -->

					</a-col>
					<a-col :span="24" :md="12" class="footer-control pr-20" align="right" style="color: #fff;">
						Typing.mn
					</a-col>
				</a-row>
			</a-layout-footer>
		</div>
  </div>
</template>

<style lang="scss" scoped>
.terms {
  width: 100%;
  justify-content: center;
  display: flex;

  .container {
    width: 70%;
  }
}
</style>
<script>
const year = new Date().getFullYear();
  export default {
    data() {
      return {
        index: 1,
        year,
      };
    },
    methods: { },
  }
</script>